//Задача 4

Console.Write("Введите первое число a: ");
int a = Convert.ToInt32(Console.ReadLine());
if (a % 2 == 0)
{
    Console.WriteLine("да");
}
else
    Console.WriteLine("нет");

